# Скопіювати функцію add із попереднього прикладу. Написати декоратор cached. Суть декоратора в
# кешуванні роботи функції add. Тобто треба створити словник де ключами будуть аргументи (
# позиційні ) а значенням буде результат виконання функції add. Відповідно декоратор має перевіряти
# чи є дані в словнику(була вже викликана функція add із такими аргументами) і вернути результат.
# Програмно перевірити чи дані беруться із кешу чи виконується функція add?

def add(*args):
    sum_result = 0
    for i in args:
        sum_result +=i
    return sum_result